# StructuralElevationAtBottomSurvey Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralElevationAtBottomSurvey Property
ParameterTypeId Class See Also
---
"Elevation at Bottom Survey"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralElevationAtBottomSurvey { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralElevationAtBottomSurvey As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralElevationAtBottomSurvey {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace